adding CI
